Revit 2027 API
DirectShapeType.AddExternallyTaggedGeometry Method
 Adds the externally tagged geometry object to the DirectShapeType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddExternallyTaggedGeometry(
	ExternallyTaggedGeometryObject externallyTaggedGeometry
)
Public Sub AddExternallyTaggedGeometry (
	externallyTaggedGeometry As ExternallyTaggedGeometryObject
)
public:
void AddExternallyTaggedGeometry(
	ExternallyTaggedGeometryObject^ externallyTaggedGeometry
)
member AddExternallyTaggedGeometry :
        externallyTaggedGeometry : ExternallyTaggedGeometryObject -> unit
Parameters
externallyTaggedGeometry ExternallyTaggedGeometryObject
 The externally tagged geometry that should be added to the DirectShapeType.
Exceptions
Exception | Condition
ArgumentException |  The input shape does not satisfy DirectShapeType validation criteria. -or- The input geometry does not have a permitted usage. -or- The externallyTaggedGeometry has already been added to this DirectShapeType.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DirectShapeType Class
Autodesk.Revit.DB Namespace